# Даны две переменные целого типа: A и B.
# Если их значения не равны, то присвоить первой переменной сумму этих значений,
# а если равны, то присвоить переменным нулевые значения.
# Вывести новые значения переменных A и B

# a = int(input("Введи число А:  "))
# b = int(input("Введи число В:  "))
#
# if a != b:
#     a = a + b
# else:
#     a = 0
#     b = 0
#
# print("a =   ", a, "b =  ", b)

#== >  < =>  <=
#Ввести 2 числа. Если их произведение отрицательно, умножить его на 8, в противном случае увеличить его в 1.5 раза.


# Дано целое число. Если оно является положительным,
# то прибавить к нему 20, в противном случае вычесть из него 5.


# программа калькулятор


# // - делит число нацело, отбрасывая остаток
# % - берет остаток, отбрасывая целую часть

#Ввести двузначное число, найти сумму его цифр
#46 -> 4 + 6 = 10
a = int(input("Введи число А:  "))
c = a // 10 #4
b = a % 10  #6
sum = c + b
print("Сумма = ", sum)





#Определить, является ли число четным

#Посчитать сумма чисел от 1 до 10

#Посчитать  сумму и количество отрицательных чисел

#Положительные числа увеличить в два раза
# for i in f:
#     if i > 0:
#         i = i * 2 # i *= 2
#         print(i)

#Найти и вывести среднее арифметическое положительных чисел


#Умножить каждый элемент списка на 2 и сохранить результат в новый список

#Найти минимальный элемент в списке

#Удалить из списка все элементы, равные заданному значению

#Удалить из списка все отрицательные элементы




#range(3) -> 1, 2, 3

#len(list_1) -> 3
